tutorials/cases/prescribedUsCases/diverging/constant/reactions
species
(
    N2
);

reactions
{
}
